In [1]:
import pandas as pd

In [2]:
data = {'Name':['James','Daniel','Mike'],'Age':[29,17,33],'City':['Abuja','Lagos','Akure']}
df = pd.DataFrame(data)
df

     Name  Age   City
0   James   29  Abuja
1  Daniel   17  Lagos
2    Mike   33  Akure

In [3]:
df['Salary'] = [2000,5000,6400]
df

     Name  Age   City  Salary
0   James   29  Abuja    2000
1  Daniel   17  Lagos    5000
2    Mike   33  Akure    6400

In [4]:
df['Marital Status'] = ['Single','Married','Engaged']
df

     Name  Age   City  Salary Marital Status
0   James   29  Abuja    2000         Single
1  Daniel   17  Lagos    5000        Married
2    Mike   33  Akure    6400        Engaged

In [5]:
rate = pd.read_csv('downloads/exchange20092024 (1).csv')
rate.head()

,Rate Date,Currency,Rate Year,Rate Month,Buying Rate,Central Rate,Selling Rate
9/19/2024,CFA,2024,September,2.7819,2.7919,2.8019,NaN
9/19/2024,YUAN/RENMINBI,2024,September,225.3505,225.4212,225.4919,NaN
9/19/2024,DANISH KRONA,2024,September,237.4456,237.5201,237.5946,NaN
9/19/2024,EURO,2024,September,1771.4938,1772.0498,1772.6058,NaN
9/19/2024,YEN,2024,September,11.1232,11.1267,11.1302,NaN

In [26]:
df.drop_duplicates()

     Name  Age   City  Salary Marital Status
0   James   29  Abuja    2000         Single
1  Daniel   17  Lagos    5000        Married
2    Mike   33  Akure    6400        Engaged

In [9]:
rate['Rate Date'].duplicated()

9/19/2024     False
9/19/2024     False
9/19/2024     False
9/19/2024     False
9/19/2024     False
              ...
12/10/2001     True
12/10/2001     True
12/10/2001     True
12/10/2001     True
12/10/2001     True
Name: Rate Date, Length: 56068, dtype: bool

In [10]:
rate['Rate Date'].unique()

array(['CFA', 'YUAN/RENMINBI', 'DANISH KRONA', 'EURO', 'YEN', 'RIYAL',
       'SOUTH AFRICAN RAND', 'SDR', 'SWISS FRANC', 'POUNDS STERLING',
       'US DOLLAR', 'WAUA', 'POUND STERLING', 'DANISH KRONER',
       'JAPANESE YEN', 'US DOLLAR ', 'YEN ', 'CFA ', 'WAUA ', 'SDR ',
       'EURO\t', 'EURO ', 'RIYAL ', 'SWISS FRANC\t', 'SDR\t', 'NAIRA',
       'POESO'], dtype=object)

In [25]:
df.drop_duplicates(subset='Rate Date', keep='first')

KeyError: Index(['Rate Date'], dtype='object')